Revit 2027 API
BuiltInFailures.EditingFailures.CannotMoveElement Property
 Can't move element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveElement { get; }
Public Shared ReadOnly Property CannotMoveElement As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveElement {
	FailureDefinitionId^ get ();
}
static member CannotMoveElement : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace